In [31]:
print("Alô Mundo!!")

Alô Mundo!!

In [32]:
! pip install sqlalchemy

Requirement already satisfied: sqlalchemy in c:\users\ead\desktop\projetofinal_tarde\.venv\lib\site-packages (2.0.31)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\ead\desktop\projetofinal_tarde\.venv\lib\site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\ead\desktop\projetofinal_tarde\.venv\lib\site-packages (from sqlalchemy) (3.0.3)

In [33]:
import pandas as pd

In [34]:
# Módulo
from sqlalchemy import  create_engine

In [35]:
! pip install pymysql

Requirement already satisfied: pymysql in c:\users\ead\desktop\projetofinal_tarde\.venv\lib\site-packages (1.1.1)

In [36]:
import pymysql

In [57]:

import pymysql
import urllib.parse
# definir as credenciais 
user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
database='schooltracker'
# criar uma url de conexão 
connection_string = f'mysql+pymysql://{user}:{password}@{host}/{database}'
# criar a conexão com o create_engine()
engine = create_engine(connection_string)
# escrever uma consulta SQL
query_alunos = "SELECT * FROM aluno"
query_diarios = "SELECT * FROM diariobordo"
query_avaliacao = " SELECT * FROM avaliacao"
# criar dataframe
df_alunos = pd.read_sql(query_alunos,engine)
df_diarios = pd.read_sql(query_diarios,engine)
df_avaliacao = pd.read_sql(query_avaliacao,engine)
# mostrar os cinco primeiros
df_alunos.head()

   id        ra  Nome  Tempo_de_Estudo  Renda_Media_Salarial_Familiar
0   7  00034548  None              NaN                            NaN
1   8  00034549  None              NaN                            NaN
2   9  00034550  None              NaN                            NaN
3  10  00034551  None              NaN                            NaN
4  11  00034552  None              NaN                            NaN

## Quais bibliotecas um cientista de dados utiliza?

- Pandas
- NumPy
- Fundamentos de IA (Scikit-Learn)

- Material Didático
- Pandas e NumPy (Notebook)
- Scikit-Learn (Apostila do SENAI)

### PANDAS: ciência de dados
### SCKIT-LEARN:  elaboração de modelos de IA
### NUMPY: matemática

# 05/08/24

- Carregar dados(ok)

- Salvar um dataframe

In [56]:
csv_filename = 'alunos.csv'
df_alunos.to_csv(csv_filename, index=False)

# Eu salvei o dataframe!

# Exercício - Salve o DataFrame no formato JSON

In [39]:
csv_filename = 'alunos.json'
df_alunos.to_json(csv_filename, index=False)

In [40]:
! pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\ead\desktop\projetofinal_tarde\.venv\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\ead\desktop\projetofinal_tarde\.venv\lib\site-packages (from openpyxl) (1.1.0)

In [41]:
csv_filename = 'planilha_alunos.xlsx'
df_alunos.to_excel(csv_filename, index=False)

# Um novo DataFrame

In [42]:
df_alunos.columns

Index(['id', 'ra', 'Nome', 'Tempo_de_Estudo', 'Renda_Media_Salarial_Familiar'], dtype='object')

In [43]:
df_tempo_renda = df_alunos[['Tempo_de_Estudo', 'Renda_Media_Salarial_Familiar']]
df_tempo_renda

     Tempo_de_Estudo  Renda_Media_Salarial_Familiar
0                NaN                            NaN
1                NaN                            NaN
2                NaN                            NaN
3                NaN                            NaN
4                NaN                            NaN
..               ...                            ...
97               4.0                        4171.25
98               2.0                        6914.47
99               8.0                        8125.69
100              3.0                        2561.36
101              1.0                        4765.48

[102 rows x 2 columns]

## Tipos

In [44]:
print(type(df_tempo_renda))

<class 'pandas.core.frame.DataFrame'>

## Exercício: crie um recurso para mostrar apenas uma coluna. Mostre qual tipo desse recurso.

In [45]:
serie_tempo_renda = df_tempo_renda['Renda_Media_Salarial_Familiar']

In [46]:
type(serie_tempo_renda)

pandas.core.series.Series

## Revisando Funções Básicas

- Exercício 01: retorne o dataframe da última aula com as duas primeiras linhas como amostras.

In [47]:
df_tempo_renda.head(2)

   Tempo_de_Estudo  Renda_Media_Salarial_Familiar
0              NaN                            NaN
1              NaN                            NaN

- Exercício 02: agora retorne as duas últimas linhas da amostra.

In [48]:
df_tempo_renda.tail(2)

     Tempo_de_Estudo  Renda_Media_Salarial_Familiar
100              3.0                        2561.36
101              1.0                        4765.48

- Exercício 3: retorne uma tupla com número de linhas e colunas

In [49]:
df_tempo_renda.shape

(102, 2)

- Exercício 4: retorne as informações gerais do dataframe.

In [50]:
df_tempo_renda.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 102 entries, 0 to 101
Data columns (total 2 columns):
 #   Column                         Non-Null Count  Dtype
---  ------                         --------------  -----
 0   Tempo_de_Estudo                49 non-null     float64
 1   Renda_Media_Salarial_Familiar  49 non-null     float64
dtypes: float64(2)
memory usage: 1.7 KB

In [51]:
qtde = len(df_tempo_renda)
if qtde <= 102:
    print(f'quantidade: {qtde} é ideal')

quantidade: 102 é ideal

- Exercício 05: retorne colunas

In [52]:
df_tempo_renda.columns

Index(['Tempo_de_Estudo', 'Renda_Media_Salarial_Familiar'], dtype='object')

- Exercício 06: retorne as informações apenas da coluna rendafamiliar

In [53]:
df_tempo_renda['Renda_Media_Salarial_Familiar'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 102 entries, 0 to 101
Series name: Renda_Media_Salarial_Familiar
Non-Null Count  Dtype
--------------  -----
49 non-null     float64
dtypes: float64(1)
memory usage: 948.0 bytes

- Exercício 07: Mostre os tipos com dtypes

In [54]:
df_alunos.dtypes

id                                 int64
ra                                object
Nome                              object
Tempo_de_Estudo                  float64
Renda_Media_Salarial_Familiar    float64
dtype: object

- Estatística

In [55]:
df_alunos.describe()

               id  Tempo_de_Estudo  Renda_Media_Salarial_Familiar
count  102.000000        49.000000                      49.000000
mean    57.500000         4.693878                    4644.281429
std     29.588849         2.510014                    2259.802832
min      7.000000         1.000000                    1417.000000
25%     32.250000         3.000000                    2690.520000
50%     57.500000         5.000000                    4271.350000
75%     82.750000         7.000000                    6914.470000
max    108.000000         9.000000                    9314.250000

- DataFrame diario de bordo

- Gerar csv

In [59]:
csv_diariob = 'diarios.csv'
df_diarios.to_csv(csv_diariob, index=False)

- Gerar json

In [60]:
csv_diariob = 'diario.json'
df_diarios.to_json(csv_diariob, index=False)

In [58]:
df_diarios.head()

,id,texto,datahora,fk_aluno_id
0,9,Participou das aulas de matemática e português...,2024-07-30 08:30:00,7
1,10,Aulas de ciências e história. Contribuiu com p...,2024-07-31 09:00:00,7
2,11,Fez a prova de matemática com bom desempenho. ...,2024-07-30 10:00:00,8
3,12,Aulas de educação física e artes. Mostrou gran...,2024-07-31 11:00:00,8
4,13,Participou das aulas de matemática e português...,2024-07-30 08:30:00,9

In [61]:
df_diarios.tail(2)

,id,texto,datahora,fk_aluno_id
12,22,Aulas de ciências e história. Contribuiu com p...,2024-07-31 09:00:00,9
13,23,Hoje aprendi a inserir dados na tabela com o c...,2024-07-31 17:48:00,59

In [62]:
df_diarios.shape

(14, 4)

In [63]:
df_diarios.dtypes

id                      int64
texto                  object
datahora       datetime64[ns]
fk_aluno_id             int64
dtype: object

In [64]:
df_diarios.columns

Index(['id', 'texto', 'datahora', 'fk_aluno_id'], dtype='object')

In [78]:
df_diarios.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14 entries, 0 to 13
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           14 non-null     int64
 1   texto        14 non-null     object
 2   datahora     14 non-null     datetime64[ns]
 3   fk_aluno_id  14 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 580.0+ bytes

In [77]:
df_diarios['texto'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 14 entries, 0 to 13
Series name: texto
Non-Null Count  Dtype
--------------  -----
14 non-null     object
dtypes: object(1)
memory usage: 244.0+ bytes

In [66]:
df_diarios['datahora']

0    2024-07-30 08:30:00
1    2024-07-31 09:00:00
2    2024-07-30 10:00:00
3    2024-07-31 11:00:00
4    2024-07-30 08:30:00
5    2024-07-31 09:00:00
6    2024-07-31 17:48:00
7    2024-07-30 08:30:00
8    2024-07-31 09:00:00
9    2024-07-30 10:00:00
10   2024-07-31 11:00:00
11   2024-07-30 08:30:00
12   2024-07-31 09:00:00
13   2024-07-31 17:48:00
Name: datahora, dtype: datetime64[ns]

In [76]:
df_diarios['texto']

0     Participou das aulas de matemática e português...
1     Aulas de ciências e história. Contribuiu com p...
2     Fez a prova de matemática com bom desempenho. ...
3     Aulas de educação física e artes. Mostrou gran...
4     Participou das aulas de matemática e português...
5     Aulas de ciências e história. Contribuiu com p...
6     Hoje aprendi a inserir dados na tabela com o c...
7     Participou das aulas de matemática e português...
8     Aulas de ciências e história. Contribuiu com p...
9     Fez a prova de matemática com bom desempenho. ...
10    Aulas de educação física e artes. Mostrou gran...
11    Participou das aulas de matemática e português...
12    Aulas de ciências e história. Contribuiu com p...
13    Hoje aprendi a inserir dados na tabela com o c...
Name: texto, dtype: object

In [67]:
df_avaliacao.head()

   id  nota1  nota2  nota3  nota4  fk_aluno_id
0   1     10     20     21     19            7
1   2     10     25     20      8           15
2   3     10     24     18      9           10
3   4     25     24     23     59           25

In [68]:
df_avaliacao.head(2)

   id  nota1  nota2  nota3  nota4  fk_aluno_id
0   1     10     20     21     19            7
1   2     10     25     20      8           15

In [69]:
df_avaliacao.tail(2)

   id  nota1  nota2  nota3  nota4  fk_aluno_id
2   3     10     24     18      9           10
3   4     25     24     23     59           25

In [70]:
df_avaliacao.dtypes

id             int64
nota1          int64
nota2          int64
nota3          int64
nota4          int64
fk_aluno_id    int64
dtype: object

In [71]:
df_avaliacao['nota1'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: nota1
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 164.0 bytes

In [79]:
df_avaliacao.describe()

             id  nota1      nota2      nota3     nota4  fk_aluno_id
count  4.000000   4.00   4.000000   4.000000   4.00000     4.000000
mean   2.500000  13.75  23.250000  20.500000  23.75000    14.250000
std    1.290994   7.50   2.217356   2.081666  24.01909     7.889867
min    1.000000  10.00  20.000000  18.000000   8.00000     7.000000
25%    1.750000  10.00  23.000000  19.500000   8.75000     9.250000
50%    2.500000  10.00  24.000000  20.500000  14.00000    12.500000
75%    3.250000  13.75  24.250000  21.500000  29.00000    17.500000
max    4.000000  25.00  25.000000  23.000000  59.00000    25.000000

In [80]:
df_avaliacao['fk_aluno_id'].info()

<class 'pandas.core.series.Series'>
RangeIndex: 4 entries, 0 to 3
Series name: fk_aluno_id
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 164.0 bytes

In [81]:
len(df_alunos)

102

In [82]:
len(df_diarios)

14

- Fatiamento

In [83]:
df_diarios[7:15]

,id,texto,datahora,fk_aluno_id
7,17,Participou das aulas de matemática e português...,2024-07-30 08:30:00,7
8,18,Aulas de ciências e história. Contribuiu com p...,2024-07-31 09:00:00,7
9,19,Fez a prova de matemática com bom desempenho. ...,2024-07-30 10:00:00,8
10,20,Aulas de educação física e artes. Mostrou gran...,2024-07-31 11:00:00,8
11,21,Participou das aulas de matemática e português...,2024-07-30 08:30:00,9
12,22,Aulas de ciências e história. Contribuiu com p...,2024-07-31 09:00:00,9
13,23,Hoje aprendi a inserir dados na tabela com o c...,2024-07-31 17:48:00,59

- Vamos fazer um join?

### Passo para o merge

- Use o camando merge
- Criar uma variável - pode ser resultado o nome.
- pd.merge(dataframe1,dataframe2, tipo_uniao,qual a chave da direita, qual chave da esq.) - queremos unir
- Qual o tipo de uniao: how='inner'
- O parâmetro how define o tipo de join qu estamos realizando
- inner significa que queremos um join interno, o que resulta em apena as linhas que têm correspondência em ambos os DataFrames.

In [86]:
# Realizar o join
resultado = pd.merge(df_diarios,df_alunos, how='inner', left_on='fk_aluno_id', right_on='id')

# Selecionar as colunas desejadas
resultado_selecionado = resultado [['texto','datahora','ra']]

#Mostrar o resultado
resultado_selecionado.head()

,texto,datahora,ra
0,Participou das aulas de matemática e português...,2024-07-30 08:30:00,00034548
1,Aulas de ciências e história. Contribuiu com p...,2024-07-31 09:00:00,00034548
2,Fez a prova de matemática com bom desempenho. ...,2024-07-30 10:00:00,00034549
3,Aulas de educação física e artes. Mostrou gran...,2024-07-31 11:00:00,00034549
4,Participou das aulas de matemática e português...,2024-07-30 08:30:00,00034550

- Crie uma junção do dataframe aluno com avaliação. Mostre as notas e o RA do aluno.

In [87]:
uniao = pd.merge(df_avaliacao,df_alunos,how='inner',left_on='fk_aluno_id', right_on='id')

uniao_selecionada = uniao[['nota1','nota2','nota3','nota4','ra']]

uniao_selecionada.head()

   nota1  nota2  nota3  nota4        ra
0     10     20     21     19  00034548
1     10     25     20      8  00034556
2     10     24     18      9  00034551
3     25     24     23     59  00034566